In [1]:
import pandas as pd
import sqlite3
import os

In [2]:
path = os.path.abspath(os.path.join(os.getcwd(), os.path.pardir))

In [3]:
def create_connection(db_file):
    conn = None
    try:
        conn = sqlite3.connect(db_file)
    except Error as e:
        print(e)

    return conn

In [4]:
conn = create_connection(os.path.join(path, "data/league.db"))

In [5]:
sql = """
SELECT * from team_stats
GROUP BY Result
"""
pd.read_sql_query(sql, conn)

,Club_Name,Result,Kills,First_Blood,Towers,First_Tower,Dragons,Barons,Gold,Ban_1,Ban_2,Ban_3,Ban_4,Ban_5,Pick_1,Pick_2,Pick_3,Pick_4,Pick_5,Match_id
0,Najin e,Emfire,6,0.0,3,0,1,0,57.9k,Lulu,Twisted,Gangplank,None,None,Maokai,RekSai,Ryze,Kalista,Thresh,21201
1,H2k,Gaming,15,1.0,2,1,2,0,58.6k,Ekko,Miss,Viktor,None,None,Rumble,Lee,Ryze,Sivir,Karma,46981
2,Paris Saint,Germain,18,1.0,10,1,3,1,58.4k,Twitch,KogMaw,Galio,Nunu,Sejuani,Gragas,KhaZix,Taliyah,Tristana,Thresh,80411
3,Dark Passage Academy,LOSS,17,0.0,1,0,2,0,57.3k,Irelia,Yone,Akali,Akshan,Jayce,Gragas,Hecarim,Ahri,Jinx,Leona,391210
4,E,MonkeyzClub,13,1.0,11,1,4,1,60.2k,Aatrox,Olaf,Qiyana,Thresh,Jarvan,Akali,Skarner,Ahri,Xayah,Rakan,195971
5,G,Rex,6,0.0,2,0,1,0,56.7k,Yuumi,Olaf,Renekton,Aatrox,Gangplank,Kled,Elise,Rumble,Ezreal,Tahm,202391
6,R,SIXTEAM,11,0.0,4,1,0,0,57.2k,Irelia,Nocturne,Alistar,Graves,Ornn,Viktor,Xin,Zoe,Xayah,Thresh,148120
7,E WIE EINFACH E,SPORTS,13,1.0,5,0,1,0,48.9k,Xin,Lucian,Jayce,Veigar,Cassiopeia,Wukong,Diana,Renekton,Zeri,Blitzcrank,378310
8,KaBuM! e,Sports,20,1.0,11,0,4,1,64.3k,Caitlyn,Hecarim,Ryze,Alistar,Tahm,Gnar,Lee,Vex,Aphelios,Nautilus,389360
9,ahq e,SportsClub,17,0.0,8,0,3,1,55.1k,Twisted,Galio,Renekton,Mordekaiser,Kennen,Jayce,Ekko,Sett,Jhin,Thresh,265201
10,Fenerbah√ße Academy,WIN,19,1.0,8,1,2,1,47.6k,LeBlanc,Volibear,Ryze,Sett,Tryndamere,Lee,Kindred,Syndra,Xayah,Renata,391212

#FOUND SOME UNVALID DATA

In [6]:
sql = """
SELECT * from team_stats
WHERE Result IN ("WIN", "LOSS")
"""
pd.read_sql_query(sql, conn)

,Club_Name,Result,Kills,First_Blood,Towers,First_Tower,Dragons,Barons,Gold,Ban_1,Ban_2,Ban_3,Ban_4,Ban_5,Pick_1,Pick_2,Pick_3,Pick_4,Pick_5,Match_id
0,Dark Passage Academy,LOSS,17,0.0,1,0,2,0.0,57.3k,Irelia,Yone,Akali,Akshan,Jayce,Gragas,Hecarim,Ahri,Jinx,Leona,391210
1,Fenerbah√ße Academy,LOSS,16,0.0,7,1,1,1.0,62.4k,Volibear,Lee,LeBlanc,Sett,Camille,Akshan,Xin,Ryze,Xayah,Tahm,391211
2,Fenerbah√ße Academy,WIN,19,1.0,8,1,2,1.0,47.6k,LeBlanc,Volibear,Ryze,Sett,Tryndamere,Lee,Kindred,Syndra,Xayah,Renata,391212
3,Fenerbah√ße Academy,WIN,21,1.0,8,0,3,1.0,47.9k,LeBlanc,Volibear,Ryze,Ahri,Orianna,Aatrox,Lee,Syndra,Kaisa,Leona,391213
4,Dusty,WIN,19,1.0,7,1,1,1.0,53.7k,Nidalee,Diana,Tahm,Gangplank,Karma,Gnar,Volibear,Akali,Jinx,Nautilus,390410
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
55411,Copenhagen Wolves,LOSS,6,1.0,3,0,1,0.0,42.1k,Dr.,Yasuo,Kassadin,None,None,Shyvana,Olaf,Zyra,Lucian,Lulu,47100
55412,Fnatic,WIN,15,1.0,8,0,1,1.0,72.5k,Yasuo,Elise,LeBlanc,None,None,Renekton,Vi,Ziggs,Jinx,Leona,47090
55413,Roccat,WIN,14,0.0,9,0,2,2.0,59.5k,Vi,Dr.,Shyvana,None,None,Malphite,Elise,Pantheon,Lucian,Thresh,47080
55414,Alliance,LOSS,9,1.0,4,1,1,0.0,54.7k,Kassadin,KhaZix,Ziggs,None,None,Renekton,Vi,Gragas,Caitlyn,Thresh,47070
55415,Gambit Gaming,LOSS,5,0.0,1,0,3,0.0,45.2k,Kassadin,Nidalee,Elise,None,None,Dr.,Shyvana,LeBlanc,Lucian,Thresh,47060

In [34]:
sql = """
SELECT 
Club_Name,
COUNT(CLub_Name) Total_Games,
ROW_NUMBER() OVER (ORDER BY Count(CLub_Name) DESC) Row_Number
FROM team_stats
GROUP BY Club_Name
"""
pd.read_sql_query(sql, conn)

           Club_Name  Total_Games  Row_Number
0        KT Rolster           702           1
1            Fnatic           617           2
2    Afreeca Freecs           588           3
3       Team Liquid           536           4
4        G2 Esports           513           5
..               ...          ...         ...
760           FALKN             2         761
761        Chungnam             2         762
762      SDX Gaming             1         763
763        Random 5             1         764
764        Gyeonggi             1         765

[765 rows x 3 columns]

In [38]:
sql = """
SELECT 
Club_Name,
SUM(Kills) Total_Kills,
ROW_NUMBER() OVER (ORDER BY SUM(Kills) DESC) Row_Number
FROM team_stats
GROUP BY Club_Name
"""
pd.read_sql_query(sql, conn)

                 Club_Name  Total_Kills  Row_Number
0                  Fnatic          8492           1
1              KT Rolster          8379           2
2              G2 Esports          7277           3
3             Team Liquid          6813           4
4     Royal Never Give Up          6557           5
..                     ...          ...         ...
760              Gyeonggi            10         761
761              Chungnam             9         762
762         I Gaming Star             8         763
763  GC Busan Rising Star             5         764
764              Random 5             3         765

[765 rows x 3 columns]

In [35]:
sql = """
SELECT 
Club_Name,
COUNT(Club_Name) Total_Games,
AVG(Gold),
ROW_NUMBER() OVER (ORDER BY AVG(Gold) DESC) Row_Number
FROM team_stats
GROUP BY Club_Name
"""
pd.read_sql_query(sql, conn)

        Club_Name  Total_Games  AVG(Gold)  Row_Number
0          Crew e            4  73.775000           1
1           RAMS             9  72.300000           2
2    ahq eSports            23  71.800000           3
3          I MAY             6  71.233333           4
4     Keyd Stars            44  70.870455           5
..            ...          ...        ...         ...
760    Besiktas E            5  36.940000         761
761     Random 5             1  36.900000         762
762      Mineski             2  36.900000         763
763          CMG             4  32.925000         764
764     Chungnam             2  32.150000         765

[765 rows x 4 columns]

In [37]:
sql = """
SELECT 
Club_Name,
COUNT(Club_Name) Total_Games,
AVG(Kills),
ROW_NUMBER() OVER (ORDER BY AVG(Kills) DESC) Row_Number
FROM team_stats
GROUP BY Club_Name
"""
pd.read_sql_query(sql, conn)

                 Club_Name  Total_Games  AVG(Kills)  Row_Number
0              SDX Gaming             1   24.000000           1
1            LPL Allstars             4   23.000000           2
2       Cloud9 Challenger             3   22.666667           3
3    Samsung Galaxy White            17   22.588235           4
4         SK Telecom T1 K             9   21.777778           5
..                     ...          ...         ...         ...
760                  Ever             4    4.750000         761
761              Chungnam             2    4.500000         762
762         I Gaming Star             2    4.000000         763
763              Random 5             1    3.000000         764
764  GC Busan Rising Star             2    2.500000         765

[765 rows x 4 columns]

In [41]:
sql = """
SELECT 
Ban_1,
Count(Ban_1) total_bans_1,
ROW_NUMBER() OVER (ORDER BY Count(Ban_1) DESC) Row_Number
FROM team_stats
GROUP BY Ban_1
"""
pd.read_sql_query(sql, conn)

       Ban_1  total_bans_1  Row_Number
0    LeBlanc          1750           1
1     Thresh          1654           2
2    Kalista          1634           3
3        Zoe          1548           4
4    Camille          1481           5
..       ...           ...         ...
155    Amumu             7         156
156  Warwick             5         157
157    Nasus             5         158
158    Teemo             4         159
159    Garen             2         160

[160 rows x 3 columns]

In [47]:
sql = """
SELECT 
Pick_1,
Count(Pick_1) total_picks_1,
ROW_NUMBER() OVER (ORDER BY Count(Pick_1) DESC) Row_Number
FROM team_stats
GROUP BY Pick_1
"""
pd.read_sql_query(sql, conn)

         Pick_1  total_picks_1  Row_Number
0          Gnar           4496           1
1      Renekton           4107           2
2          Ornn           3728           3
3       Camille           3003           4
4        Aatrox           2895           5
..          ...            ...         ...
120       Elise              1         121
121      Draven              1         122
122     Caitlyn              1         123
123  Blitzcrank              1         124
124       Amumu              1         125

[125 rows x 3 columns]

In [48]:
sql = """
SELECT 
Pick_5,
Count(Pick_1) total_picks_5,
ROW_NUMBER() OVER (ORDER BY Count(Pick_5) DESC) Row_Number
FROM team_stats
GROUP BY Pick_5
"""
pd.read_sql_query(sql, conn)

         Pick_5  total_picks_5  Row_Number
0         Braum           6488           1
1        Thresh           6265           2
2       Alistar           5323           3
3      Nautilus           4785           4
4         Leona           4487           5
..          ...            ...         ...
82   Cassiopeia              1          83
83      Caitlyn              1          84
84     Aurelion              1          85
85       Anivia              1          86
86       Aatrox              1          87

[87 rows x 3 columns]

In [52]:
sql = """
SELECT 
Club_Name,
SUM(First_Blood),
ROW_NUMBER() OVER (ORDER BY SUM(First_Blood) DESC) Row_Number
FROM team_stats
GROUP BY Club_Name
"""
pd.read_sql_query(sql, conn)

                 Club_Name  SUM(First_Blood)  Row_Number
0              KT Rolster              395.0           1
1                  Fnatic              354.0           2
2          Afreeca Freecs              314.0           3
3             Team Liquid              284.0           4
4              G2 Esports              256.0           5
..                     ...               ...         ...
760            Gama Dream                0.0         761
761  GC Busan Rising Star                0.0         762
762  Dynamo Eclot Academy                0.0         763
763             Bigetron E               0.0         764
764       Armored Project                0.0         765

[765 rows x 3 columns]

In [20]:
sql = """
SELECT * from General_data
"""
pd.read_sql_query(sql, conn)

,Match_id,Date,Blue_Team,Red_Team,Tournament,Time,Game_Version
0,391210,2022-03-21 (SEMIFINALS),FB,DP,Turkey Academy Winter Playoffs 2022,33:41,v12.5
1,391211,2022-03-21 (SEMIFINALS),FB,DP,Turkey Academy Winter Playoffs 2022,34:54,v12.5
2,391212,2022-03-21 (SEMIFINALS),FB,DP,Turkey Academy Winter Playoffs 2022,22:06,v12.5
3,391213,2022-03-21 (SEMIFINALS),FB,DP,Turkey Academy Winter Playoffs 2022,22:26,v12.5
4,390410,2022-03-21 (ROUND2),RDL,Dusty,NLC Spring Playoffs 2022,26:38,v12.5
...,...,...,...,...,...,...,...
30958,47100,2014-01-14 (WEEK1),GMB,CW,EU LCS Spring 2014,30:37,v3.15
30959,47090,2014-01-14 (WEEK1),Alliance,Fnatic,EU LCS Spring 2014,43:49,v3.15
30960,47080,2014-01-14 (WEEK1),SHC,Roccat,EU LCS Spring 2014,31:14,v3.15
30961,47070,2014-01-14 (WEEK1),CW,Alliance,EU LCS Spring 2014,41:14,v3.15
30962,47060,2014-01-14 (WEEK1),Fnatic,GMB,EU LCS Spring 2014,32:04,v3.15

In [29]:
len(df.where(df['Result'] == 'WIN').dropna())

27855